Merge pull request #13 from Shrpp/feat/smtp-and-web-auth
Feat/smtp and web auth
